Hello = '''
Приветствуем вас в MySubs! 🌟  
Устали забывать о подписках? Мы здесь, чтобы помочь!
Оставайтесь на волне всех своих подписок и контролируйте расходы без лишних забот
➡️ /start Начните прямо сейчас!
'''

donations_text = '''
💖 Поддержите наш проект!

Если вам нравится наш бот и вы хотите помочь в его развитии, вы можете сделать донат.
Ваша поддержка очень важна для нас и поможет улучшить функционал и добавить новые возможности.

Рекомендуем ознакомится с офертой по ссылке:
https://telegra.ph/Usloviya-servisa-sbora-donatov-publichnaya-oferta-12-06

Телефон: [+7-XXX-XXX-XX-XX]
'''

profile_info = '''
Что ты можешь сделать?  
✏️ Редактировать: Поменяй никнейм.  
🗺️ Карты: Добавляй новые или редактируй старые свои карты!  
🎉 Донаты: Поддержи нас — твой вклад делает нас сильнее!

Спасибо, что с нами! ❤️
'''

auth_text = '''
🛠️ С возвращением в MySubs:

Для начала работы убедитесь, что у вас добавлена карта (название и последние 4 цифры). Это обеспечит доступ ко всем возможностям вашего аккаунта.

В MySubs вы можете:
- 📥 Добавлять подписки  
- ✏️ Редактировать  
- ❌ Удалять  

Аналитика по вашим затратам всегда под рукой!🚀
'''

after_reg_text = '''
🛠️ Перед началом работы с MySubs:

Пожалуйста, перейдите в личный кабинет и добавьте карту (название и последние 4 цифры) для доступа ко всем возможностям бота.

В MySubs вы можете:
- 📥 Добавлять подписки  
- ✏️ Редактировать  
- ❌ Удалять  

Также доступна аналитика по затратам!
'''

subs_text = '''
Теперь у вас появился доступ к трем основным функциям:

📚 Мои подписки – здесь вы сможете просмотреть все ваши текущие подписки.
✒️ Добавить подписку – с помощью этой опции вы можете легко добавить новые сервисы к своим подпискам.
📉 Аналитика – в этом разделе вы сможете увидеть статистику и анализировать свои подписки.

👉 Выберите нужную кнопку для дальнейших действий!
'''

add_sub = '''
📋 Управление подписками

Выберите один из вариантов для добавления подписки:

1. Добавить собственную подписку — введите информацию о вашей подписке вручную.
2. Выбрать из предложенных — выберите подписку из нашего списка популярных сервисов.
3. Сканировать чек — автоматически добавьте подписки, просканировав свой чек Сбербанка!

Просто нажмите на нужный вариант, и начните управлять своими подписками с легкостью!
'''

add_email = '''
📧 Добавьте свой адрес электронной почты
Чтобы максимально упростить управление подписками и автоматически добавлять их, пожалуйста, укажите ваш адрес электронной почты. Это позволит нам сканировать ваши письма на предмет подписок и уведомлений.

🔒 Обратите внимание: ваш адрес будет использоваться только для сканирования подписок и не будет передан третьим лицам.

👉 Пожалуйста, введите свой Gmail ниже:
'''

add_category = '''
🛠️ Выберите нужную категорию

Нужно выбрать категорию для добавления подписки. Пожалуйста, выберите одну из следующих категорий:

👉 Выберите нужную категорию для дальнейших действий!
'''

add_service = '''
🛠️ Выберите нужный сервис

Пожалуйста, выберите подписку из представленного списка. 

👉 Нажмите на название сервиса, чтобы добавить его к вашим подпискам!
'''

add_service_custom = '''
🛠️ Введите название сервиса

Пожалуйста, введите название подписки. 
'''

sub_duration = '''
⏳ Выберите тариф

Теперь выберите тариф, на который вы хотите подписаться. 

👉 Пожалуйста, выберите один из тарифов ниже:
'''

user_sub = '''
📝 Управление вашими подписками

При нажатии на любую из ваших подписок перед вами появится меню с двумя основными функциями:

- ✏️ Редактировать – измените детали вашей подписки, чтобы они всегда были актуальны. 
- ❌ Удалить – если какая-то подписка больше не интересует вас, просто удалите её с помощью этой функции.

👉 Выберите нужную подписку для дальнейших действий!
'''

select_edit = '''
🔧 Что вы хотите изменить?
'''

select_edit_subs = '''
📅 Управление подписками:

Вы можете редактировать свои подписки, чтобы настроить их под свои нужды. 

Вы можете редактировать следующие параметры:
- Тариф: Выберите другой тариф, если хотите изменить условия подписки.
- Карта: Измените карту, с которой будет производиться списание.
- Дата следующего списания: Установите новую дату для следующего списания.
'''

select_edit_custom_subs = '''
📅 Управление подписками:

Вы можете редактировать свои подписки, чтобы настроить их под свои нужды. 

Вы можете изменить следующие параметры:
- Название сервиса: Обновите название, если оно изменилось или вы хотите его уточнить.
- Длительность: Измените срок действия подписки в зависимости от ваших предпочтений.
- Цена: Установите новую цену, если она изменилась.
- Карта: Выберите другую карту для списания, если это необходимо.
- Дата следующего списания: Измените дату, если вам нужно перенести списание
'''

interaction_with_cards = '''
💳 Карты:

Вы можете управлять своими картами прямо здесь!

- Мои карты: Нажмите эту кнопку, чтобы просмотреть список всех ваших карт, а также управлять ими (например, редактировать или удалять).
- Добавить карту: Нажмите эту кнопку, чтобы добавить новую карту для получения уведомлений о предстоящих списаниях.
'''

my_cards_text = '''
💳 Мои карты:

Здесь вы можете увидеть все карты, которые вы добавили для получения уведомлений о предстоящих списаниях. 

✏️ Нажмите на карту, чтобы редактировать или удалить её.
'''

analicitcs_text = '''
📊 Аналитика подписок:

В этом разделе вы можете просмотреть подробную аналитику ваших подписок за последний месяц и год. 

- Аналитика за месяц: Узнайте, сколько вы потратили на подписки за последний месяц, и получите общее представление о ваших расходах.\n
'''

agreement_first_time = '''
Если вы хотите использовать функцию добавления подписки по чеку из Сбербанка, вам необходимо дать согласие на обработку персональных данных. В противном случае, вы можете не соглашаться.
С политикой обработки персональных данных вы можете ознакомится по ссылке - https://telegra.ph/Politika-obrabotki-personalnyh-dannyh-12-19
'''

agreement_second_time = '''
Если вы хотите воспользоваться этой функцией, то вам необходимо принять соглашение. В противном случае загрузка чеков в формате PDF будет недоступна.
С политикой обработки персональных данных вы можете ознакомится по ссылке - https://telegra.ph/Politika-obrabotki-personalnyh-dannyh-12-19
'''

help_text = '''
Добро пожаловать в раздел помощи!
Выберите, что вас интересует:
'''

guide_text_sber = ''' 
⬇️ПОДКЛЮЧИТЬ ПОДПИСКУ⬇️

Как подключить подписку на СберПрайм?
Чтобы подключить подписку на СберПрайм и получить доступ к эксклюзивным сервисам и скидкам, выполните следующие шаги:

Через приложение Сбера:
1. Откройте приложение Сбера Онлайн:
     - Запустите приложение на вашем мобильном устройстве.
     - Авторизуйтесь с помощью логина и пароля или биометрии (Face ID/Touch ID).

2. Перейдите в раздел подписок:
     - На главной странице нажмите на вкладку «Еще» (в правом нижнем углу).
     - В разделе «Сервисы и подписки» найдите «СберПрайм».

3. Выберите тариф:
     - Ознакомьтесь с преимуществами подписки.
     - Нажмите кнопку «Подключить».
     - Выберите подходящий тариф:
         - Месячная подписка или Годовая подписка со скидкой.

4. Оплатите подписку:
     - Подтвердите оплату подписки через привязанную банковскую карту.
     - Дождитесь подтверждения о подключении подписки.

5. Готово!
Теперь СберПрайм активирован, и вы можете пользоваться всеми преимуществами подписки.

2. Через сайт СберПрайм
1. Перейдите на сайт  СберПрайм: (https://www.sberbank.com/sberprime/home)
     - Откройте официальный сайт СберПрайм в браузере.
     - Нажмите кнопку «Подключить».

2. Войдите в личный кабинет:
     - Авторизуйтесь с использованием учетных данных вашего Сбер ID.

3. Выберите подходящий тариф:
     - Ознакомьтесь с условиями подписки.
     - Выберите месячный или годовой тариф.

4. Оплатите подписку:
     - Укажите банковскую карту для оплаты подписки и подтвердите операцию.

5. Подтверждение активации:
     - После успешной оплаты подписка будет активирована, и вы получите уведомление.

⬇️ОТКЛЮЧИТЬ ПОДПИСКУ⬇️

Как отменить подписку на СберПрайм?
Если вы решили отменить подписку на СберПрайм, выполните следующие шаги:

Через приложение Сбера:
1. Откройте приложение банка:
     - Запустите приложение на вашем мобильном устройстве.
     - Авторизуйтесь, если это необходимо.
2. Перейдите в раздел «Подписки»:
     - На главной странице приложения нажмите на вкладку «Еще» (в правом нижнем углу экрана).
     - В открывшемся меню выберите «Сервисы и подписки», затем найдите СберПрайм.
3. Отключите подписку:
     - Нажмите на активную подписку СберПрайм.
     - Выберите опцию «Отменить подписку».
     - Подтвердите отмену, следуя инструкциям на экране.
4. Проверьте статус подписки:
     - Убедитесь, что статус подписки изменился на «Отменена». Подписка останется активной до конца оплаченного периода, но дальнейшее списание средств прекратится.

Через сайт СберПрайм:
1. Перейдите на официальный сайт СберПрайм: (https://www.sberbank.com/sberprime/home)
     - Войдите в личный кабинет, используя логин и пароль от вашего аккаунта Сбер.
2. Откройте раздел подписок:
     - Найдите в меню пункт, связанный с подпиской на СберПрайм.
3. Отмените подписку:
     - Нажмите на кнопку «Отменить подписку» или аналогичную опцию.
     - Подтвердите действие, следуя инструкциям на экране.
'''

guide_text_yandex = '''
⬇️ПОДКЛЮЧИТЬ ПОДПИСКУ⬇️

Как подключить подписку на Яндекс Плюс?
Подключение подписки в Яндекс Плюс – это простой процесс, который займет всего несколько минут. Следуйте шагам ниже, чтобы активировать подписку:

1. Перейдите на страницу подписки Яндекс Плюс:
- Откройте официальный сайт Яндекс Плюс (https://plus.yandex.ru/).
- Нажмите на кнопку «Попробовать Плюс» или «Подключить».

2. Авторизуйтесь в своей учетной записи Яндекс:
- Введите логин и пароль от вашего аккаунта.
- Если у вас нет аккаунта Яндекс, создайте его, следуя подсказкам на экране.

3. Выберите подходящий тариф подписки:
- Ознакомьтесь с доступными вариантами:
   - Месячная подписка (оплата ежемесячно).
   - Годовая подписка (выгоднее за счет скидки).
- Выберите нужный тариф, нажав на соответствующую кнопку.

4. Оплатите подписку:
- Укажите банковскую карту для оплаты или выберите уже привязанную карту.
- Нажмите «Подтвердить оплату» и завершите транзакцию.

5. Получите подтверждение:
- После успешной оплаты вы увидите уведомление о том, что подписка активирована.
- Ваша подписка теперь доступна, и вы можете пользоваться всеми преимуществами Яндекс Плюс.

⬇️ОТКЛЮЧИТЬ ПОДПИСКУ⬇️

Как отменить подписку в Яндекс Плюс?
Отмена подписки в Яндекс Плюс – это простой процесс, который займет всего несколько минут. Следуйте шагам ниже, чтобы отключить подписку:

1. Перейдите на страницу управления подпиской Яндекс Плюс. (https://plus.yandex.ru/my?utm_source=domik&utm_medium=pult_web&utm_campaign=status_family)
2. Авторизуйтесь в своей учетной записи, если требуется.
3. В верхней части страницы вы увидите информацию о своей подписке, включая стоимость, дату следующего списания и способы оплаты.
4. Нажмите на кнопку «Приостановить подписку», которая находится справа от информации о подписке.
5. Подтвердите действие, следуя дальнейшим инструкциям на экране.

После отмены подписка будет активна до конца оплаченного периода, после чего списания средств прекратятся.

Если вы захотите возобновить подписку, вы всегда можете это сделать на той же странице управления.
'''

guide_text_ivi = '''
⬇️ПОДКЛЮЧИТЬ ПОДПИСКУ⬇️

Как подключить подписку на IVI?
Подключение подписки на IVI – это простой и быстрый процесс. Следуйте шагам ниже, чтобы начать пользоваться подпиской и наслаждаться фильмами и сериалами:

1. Перейдите на сайт IVI:
- Откройте официальный сайт IVI (https://www.ivi.tv/).
- Авторизуйтесь, если у вас уже есть аккаунт, или создайте новый.

2. Выберите раздел подписки:
- На главной странице или в меню выберите «Подписка».
- Ознакомьтесь с преимуществами и тарифами подписки IVI.

3. Выберите подходящий тариф:
- Месячная подписка – оплата ежемесячно.
- Годовая подписка – экономия при оплате за год.
- Нажмите кнопку «Подключить» под выбранным тарифом.

4. Укажите способ оплаты:
- Введите данные своей банковской карты или используйте другие доступные способы оплаты (например, мобильный платеж).
- Подтвердите оплату, следуя инструкциям на экране.

5. Получите подтверждение:
- После успешной оплаты вы получите уведомление об активации подписки.
- Теперь подписка активна, и вы можете сразу же начать смотреть фильмы и сериалы.

⬇️ОТКЛЮЧИТЬ ПОДПИСКУ⬇️

Как отменить подписку на IVI?
Если вы решили отменить подписку на IVI, выполните несколько простых шагов. Процесс зависит от того, где вы оформили подписку: через сайт, приложение или сторонний сервис.

1. Перейдите на сайт IVI:
- Откройте официальный сайт IVI в вашем браузере.
- Войдите в свой аккаунт.

2. Откройте настройки профиля:
- Нажмите на значок профиля в правом верхнем углу экрана.
- В выпадающем меню выберите «Мой профиль».

3. Перейдите в раздел подписок:
- В настройках профиля найдите раздел «Подписка».
- Здесь вы увидите информацию о текущей подписке и сроке её действия.

4. Отключите автопродление подписки:
- Нажмите на кнопку «Отменить подписку» или «Отключить автопродление».
- Подтвердите действие, следуя инструкциям на экране.

5. Подтверждение отмены:
- После отключения подписка останется активной до конца оплаченного периода, но средства больше списываться не будут.
'''

feedback_text = '''
Контактные данные:\n
@qumach1\n
@kse_garaeva\n
@QAmyrrh\n
@igor_stolyarov02\n
@lunoom\n
Напишите нам, если у вас возникли вопросы!
'''